Задача 1. 
Какие сочетания имен и фамилий встречаются чаще всего 
и какую долю от числа всех пассажиров они составляют?

Задача 2. 
Вывести имена людей, у которых есть полный тёзка среди пассажиров

Задача 3. 
На каких рейсах происходили самые длительные задержки? 
Выведите список из десяти рейсов, задержанных на самые длительные сроки.

Задача 4. 
В какие города можно улететь из Москвы и сколько времени это займёт?

Задача 5. 
Найдите самых дисциплинированных пассажиров,
которые зарегистрировались на все рейсы первыми. 
Учтите только тех пассажиров, которые совершали минимум два рейса.

Задача 6. 
Вывести отсортированный по количеству перелетов (по убыванию) и имени (по возрастанию) список пассажиров, 
совершивших хотя бы 1 полет.

Задача 7. 
Кто летел позавчера рейсом Москва (SVO) — Новосибирск (OVB) на месте 1A 
и когда он забронировал себе билет?

Задача 8. 
Выведите имена пассажиров, улетевших в Москву (Moscow) на самолете Боинг 777-300

Задача 9. 
Выведите пассажиров с самым длинным ФИО. 
Пробелы, дефисы и точки считаются частью имени.

Задача 10. 
Какова минимальная и максимальная продолжительность полета для каждого из возможных рейсов из
Москвы в Санкт-Петербург, 
и сколько раз вылет рейса был задержан больше, чем на час?

